src/DataProcessors/Обслуживание_ЭЛВЕСЫ_АТОЛ1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Обслуживание_ЭЛВЕСЫ_АТОЛ1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТО</Name>
					<Comment>Текущий объект торгового оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogObject.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentDeviceNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Model</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PortNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaudRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DecimalPoint</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResultCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResultDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PortIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Обслуживание_ЭЛВЕСЫ_АТОЛ1/Ext/ObjectModule.bsl
#Если Клиент Тогда

Перем ПараметрыТО Экспорт;   // Параметры торгового оборудования.
Перем Результат Экспорт;     // Результат выполнения действия.
Перем DRV Экспорт;           // Объект драйвера торгового оборудования.


// Производит инициализацию торгового оборудования.
//
Процедура Инициализация() Экспорт
	
	Если НЕ ЗагрузитьДрайвер() Тогда
		Результат.Ошибка	= Истина;
		Результат.Описание	= "Ошибка загрузки драйвера!";
		Результат.Подробно	= "Программе не удалось загрузить драйвер весов...";
		Возврат;
	КонецЕсли; 
	
	СтрокаИменСвойств = "";
	
	ПрочитатьПараметр("CurrentDeviceNumber", 1);
	ПрочитатьПараметр("Model"              , 23);
	ПрочитатьПараметр("PortNumber"	       , 99);
	ПрочитатьПараметр("PortIP"		       , "192.168.1.1:5002");
	ПрочитатьПараметр("DecimalPoint"	   , 2);
		
КонецПроцедуры
	
// Загружает драйвер ТО.
//
// Возвращаемое значение:
//  Истина - драйвер загружен, ложь - нет.
//
Функция ЗагрузитьДрайвер()
	
	Если глТорговоеОборудование.Свойство("Scale1C",DRV) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Попытка 
		ПодключитьВнешнююКомпоненту("AddIn.LP8");
		//ЗагрузитьВнешнююКомпоненту("Scale1C.dll");
		//DRV = Новый("AddIn.Scale45");
		DRV = Новый("AddIn.LP8");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	глТорговоеОборудование.Вставить("Scale1C", DRV);
	
	Возврат Истина;
КонецФункции

// Выполняет чтение параметра ТО.
//
// Параметры:
//  ИмяПараметра        - имя параметра,
//  ЗначениеПоУмолчанию - значение по умолчанию для данного параметра.
//
// Возвращаемое значение:
//  Значение параметра или значение по умолчанию
//
Процедура ПрочитатьПараметр(ИмяПараметра,ЗначениеПоУмолчанию)
	
	Если НЕ ПараметрыТО.Свойство(ИмяПараметра) Тогда
		ПараметрыТО.Вставить(ИмяПараметра,ЗначениеПоУмолчанию);
	КонецЕсли; 
	
	ЭтотОбъект[ИмяПараметра] = ПараметрыТО[ИмяПараметра];
	
КонецПроцедуры

// Выполняет действие с ТО.
//
// Параметры:
//  Действие - имя действия,
//  ПараметрыДействия - произвольный набор параметров, туда же присваивается возвращаемое значение функции.
//
Функция ВыполнитьДействие(Действие,ПараметрыДействия) Экспорт
	//
	//Если Действие = "Подключить" Тогда
	//	Подключить();
	//			
	//ИначеЕсли Действие = "Отключить" Тогда
	//	Отключить();
	//	
	//ИначеЕсли Действие = "ПолучитьВес" Тогда
	//	Результат.Вес = ПолучитьВес();
	//			
	//ИначеЕсли Действие = "УстановитьТару" Тогда
	//	УстановитьТару();
	//			
	//ИначеЕсли Действие = "УстановитьНоль" Тогда
	//	УстановитьНоль();
	//	
	//Иначе
	//	Результат.Ошибка	= Истина;
	//	Результат.Описание	= "Неизвестная команда!";
	//	Результат.Подробно	= "Команда """+Действие+""" не определена для "+ТО.Наименование;
	//	
	//КонецЕсли;
	//
	//Возврат ПараметрыДействия;
	Результат.Ошибка	= Истина;
	Результат.Описание	= "Точка входа изменена";
	Результат.Подробно	= "Команда """+Действие+""" не определена для "+ТО.Наименование;
	
	Возврат ПараметрыДействия;
		
КонецФункции

// Выполняет подключение ТО.
//
// Возвращаемое значение:
//  Истина - есть ошибка, ложь - нет.
//
Функция  Подключить() Экспорт
	
	Пока DRV.DeviceCount < CurrentDeviceNumber Цикл
        DRV.AddDevice();
	КонецЦикла;
	
	// Свойства для работы с ЛУ
	DRV.CurrentDeviceNumber	= CurrentDeviceNumber;
	DRV.CurrentDeviceName  	= Лев(ТО.Наименование,20);
	
	// Параметры связи
	DRV.Model			= Model;
	DRV.PortNumber		= PortNumber;
	DRV.PortIP			= ?(СтрНайти(PortIP,":") = 0,PortIP + ":5002",PortIP);
	// свойство появилось в версии 6.5
	Попытка
		DRV.DecimalPoint = DecimalPoint;
	Исключение
	КонецПопытки;
	
	DRV.DeviceEnabled		= 1;
	Если Ошибка() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Выполняет отключение ТО.
//
// Возвращаемое значение:
//  Истина - есть ошибка, ложь - нет.
//
Процедура Отключить() Экспорт
	
	DRV.CurrentDeviceNumber	= CurrentDeviceNumber;
	DRV.DeviceEnabled		= 0;
	Ошибка();
	
КонецПроцедуры

// Описание процедуры
//
Процедура ПрочитатьСвойстваДрайвера() Экспорт
	
	// Свойства для работы с ЛУ
	CurrentDeviceNumber	= DRV.CurrentDeviceNumber;
	
	// Параметры связи
	Model           = DRV.Model;
	PortNumber		= DRV.PortNumber;
	BaudRate		= DRV.BaudRate;
	Parity			= DRV.Parity;
	
КонецПроцедуры


Функция ПолучитьВес()  Экспорт
	
	Если DRV.DeviceEnabled=0 Тогда
		Если НЕ Подключить() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Цена)=0 Тогда
		DRV.UnitPrice=Цена;
	КонецЕсли;
	
	DRV.ReadWeight();
	
	Если Ошибка() Тогда
		Возврат DRV.ResultCode;
	КонецЕсли;
	
	Возврат DRV.Weight;
КонецФункции

Процедура УстановитьТару()  Экспорт
	
	Если DRV.DeviceEnabled=0 Тогда
		Если НЕ Подключить() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	DRV.Tare();
		
КонецПроцедуры

Процедура УстановитьНоль() Экспорт
	
	Если DRV.DeviceEnabled=0 Тогда
		Если НЕ Подключить() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	DRV.ZeroScale();
	
КонецПроцедуры

// Выполняет обработку ошибок ТО.
//
// Возвращаемое значение:
//  Истина - есть ошибка, ложь - нет.
//
Функция Ошибка()
	
	ResultCode			= DRV.ResultCode;
	ResultDescription	= DRV.ResultDescription;
	
	Если DRV.ResultCode = 0 Тогда
		Возврат Ложь;
		
	Иначе
		ЗарегистрироватьСобытие("Торговое оборудование.Ошибка",
		УровеньЖурналаРегистрации.Предупреждение,
		,
		ТО.Ссылка,
		Строка(DRV.ResultCode)+" - "+DRV.ResultDescription);
		
		Результат.Ошибка	= Истина;
		Результат.Описание	= "Ошибка драйвера: "+DRV.ResultCode;
		Результат.Подробно	= СокрЛП(DRV.ResultDescription);
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Результат = Новый Структура("Ошибка,Описание,Подробно,Вес",Ложь,"","");

#КонецЕсли
